# SetCellType Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableSectionData..::..SetCellType Method
TableSectionData Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SetCellType(Int32, CellType) | Sets a column's cell type |
| SetCellType(Int32, Int32, CellType) | Sets a cell's Type |

# See Also
TableSectionData Class
TableSectionData Members
Autodesk.Revit.DB Namespace